[Killed] BooleanLiteral
src/calculator.js:8:9
  * @param {Array} holdings - List of user holdings { instrumentId, type, name, value }
  */
 function calculatePortfolioExposure(holdings) {
-    if (!holdings || holdings.length === 0) {
+    if (holdings || holdings.length === 0) {
         return { totalValue: 0, stockExposure: [] };
     }
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10000
Received: 0

[Killed] EqualityOperator
src/calculator.js:8:22
  * @param {Array} holdings - List of user holdings { instrumentId, type, name, value }
  */
 function calculatePortfolioExposure(holdings) {
-    if (!holdings || holdings.length === 0) {
+    if (!holdings || holdings.length !== 0) {
         return { totalValue: 0, stockExposure: [] };
     }
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10000
Received: 0

[Killed] BlockStatement
src/calculator.js:16:37
     const exposureMap = new Map(); // isin -> exposure object
 
     // Helper to get or create entry in exposure map
-    const getStockEntry = (isin) => {
-        if (!exposureMap.has(isin)) {
-            const stockInfo = STOCKS.find(s => s.isin === isin);
-            exposureMap.set(isin, {
-                isin: isin,
-                ticker: stockInfo ? stockInfo.ticker : isin,
-                name: stockInfo ? stockInfo.name : "Unknown",
-                totalVal: 0,
-                directVal: 0,
-                mfVal: 0,
-                etfVal: 0
-            });
-        }
-        return exposureMap.get(isin);
-    };
+    const getStockEntry = (isin) => {};
 
     // Calculate distributions
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'directVal')

[Killed] BooleanLiteral
src/calculator.js:17:13
 
     // Helper to get or create entry in exposure map
     const getStockEntry = (isin) => {
-        if (!exposureMap.has(isin)) {
+        if (exposureMap.has(isin)) {
             const stockInfo = STOCKS.find(s => s.isin === isin);
             exposureMap.set(isin, {
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'directVal')

[Killed] ConditionalExpression
src/calculator.js:17:13
 
     // Helper to get or create entry in exposure map
     const getStockEntry = (isin) => {
-        if (!exposureMap.has(isin)) {
+        if (false) {
             const stockInfo = STOCKS.find(s => s.isin === isin);
             exposureMap.set(isin, {
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'directVal')

[Killed] ArrowFunction
src/calculator.js:18:43
     // Helper to get or create entry in exposure map
     const getStockEntry = (isin) => {
         if (!exposureMap.has(isin)) {
-            const stockInfo = STOCKS.find(s => s.isin === isin);
+            const stockInfo = STOCKS.find(() => undefined);
             exposureMap.set(isin, {
                 isin: isin,
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "TCS"
Received: "INE467B01029"

[Killed] EqualityOperator
src/calculator.js:18:48
     // Helper to get or create entry in exposure map
     const getStockEntry = (isin) => {
         if (!exposureMap.has(isin)) {
-            const stockInfo = STOCKS.find(s => s.isin === isin);
+            const stockInfo = STOCKS.find(s => s.isin !== isin);
             exposureMap.set(isin, {
                 isin: isin,
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "TCS"
Received: "RELIANCE"

[NoCoverage] StringLiteral
src/calculator.js:22:52
             exposureMap.set(isin, {
                 isin: isin,
                 ticker: stockInfo ? stockInfo.ticker : isin,
-                name: stockInfo ? stockInfo.name : "Unknown",
+                name: stockInfo ? stockInfo.name : "",
                 totalVal: 0,
                 directVal: 0,

[Killed] BlockStatement
src/calculator.js:33:27
     };
 
     // Calculate distributions
-    holdings.forEach(h => {
-        const val = parseFloat(h.value);
-        totalValue += val;
-
-        if (h.type === 'EQUITY') {
-            const entry = getStockEntry(h.instrumentId);
-            entry.directVal += val;
-            entry.totalVal += val;
-        } else {
-            const fund = FUNDS.find(f => f.id === h.instrumentId);
-            if (fund && fund.constituents) {
-                fund.constituents.forEach(c => {
-                    const indirectVal = val * (c.weight / 100);
-                    const entry = getStockEntry(c.isin);
-                    if (h.type === 'MF') entry.mfVal += indirectVal;
-                    if (h.type === 'ETF') entry.etfVal += indirectVal;
-                    entry.totalVal += indirectVal;
-                });
-            }
-        }
-    });
+    holdings.forEach(h => {});
 
     // Finalize results
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10000
Received: 0

[Killed] AssignmentOperator
src/calculator.js:35:9
     // Calculate distributions
     holdings.forEach(h => {
         const val = parseFloat(h.value);
-        totalValue += val;
+        totalValue -= val;
 
         if (h.type === 'EQUITY') {
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10000
Received: -10000

[Killed] ConditionalExpression
src/calculator.js:37:13
         const val = parseFloat(h.value);
         totalValue += val;
 
-        if (h.type === 'EQUITY') {
+        if (true) {
             const entry = getStockEntry(h.instrumentId);
             entry.directVal += val;
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'mfVal')

[Killed] EqualityOperator
src/calculator.js:37:13
         const val = parseFloat(h.value);
         totalValue += val;
 
-        if (h.type === 'EQUITY') {
+        if (h.type !== 'EQUITY') {
             const entry = getStockEntry(h.instrumentId);
             entry.directVal += val;
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'ticker')

[Survived] AssignmentOperator
src/calculator.js:39:13
 
         if (h.type === 'EQUITY') {
             const entry = getStockEntry(h.instrumentId);
-            entry.directVal += val;
+            entry.directVal -= val;
             entry.totalVal += val;
         } else {

[Killed] AssignmentOperator
src/calculator.js:40:13
         if (h.type === 'EQUITY') {
             const entry = getStockEntry(h.instrumentId);
             entry.directVal += val;
-            entry.totalVal += val;
+            entry.totalVal -= val;
         } else {
             const fund = FUNDS.find(f => f.id === h.instrumentId);
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'ticker')

[Killed] BlockStatement
src/calculator.js:41:16
             const entry = getStockEntry(h.instrumentId);
             entry.directVal += val;
             entry.totalVal += val;
-        } else {
-            const fund = FUNDS.find(f => f.id === h.instrumentId);
-            if (fund && fund.constituents) {
-                fund.constituents.forEach(c => {
-                    const indirectVal = val * (c.weight / 100);
-                    const entry = getStockEntry(c.isin);
-                    if (h.type === 'MF') entry.mfVal += indirectVal;
-                    if (h.type === 'ETF') entry.etfVal += indirectVal;
-                    entry.totalVal += indirectVal;
-                });
-            }
-        }
+        } else {}
     });
 
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'mfVal')

[Killed] ArrowFunction
src/calculator.js:42:37
             entry.directVal += val;
             entry.totalVal += val;
         } else {
-            const fund = FUNDS.find(f => f.id === h.instrumentId);
+            const fund = FUNDS.find(() => undefined);
             if (fund && fund.constituents) {
                 fund.constituents.forEach(c => {
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'mfVal')

[Killed] EqualityOperator
src/calculator.js:42:42
             entry.directVal += val;
             entry.totalVal += val;
         } else {
-            const fund = FUNDS.find(f => f.id === h.instrumentId);
+            const fund = FUNDS.find(f => f.id !== h.instrumentId);
             if (fund && fund.constituents) {
                 fund.constituents.forEach(c => {
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 650
Received: 509.99999999999994

Expected precision:    2
Expected difference: < 0.005
Received difference:   140.00000000000006

[Killed] BlockStatement
src/calculator.js:43:44
             entry.totalVal += val;
         } else {
             const fund = FUNDS.find(f => f.id === h.instrumentId);
-            if (fund && fund.constituents) {
-                fund.constituents.forEach(c => {
-                    const indirectVal = val * (c.weight / 100);
-                    const entry = getStockEntry(c.isin);
-                    if (h.type === 'MF') entry.mfVal += indirectVal;
-                    if (h.type === 'ETF') entry.etfVal += indirectVal;
-                    entry.totalVal += indirectVal;
-                });
-            }
+            if (fund && fund.constituents) {}
         }
     });
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'mfVal')

[Killed] ConditionalExpression
src/calculator.js:43:17
             entry.totalVal += val;
         } else {
             const fund = FUNDS.find(f => f.id === h.instrumentId);
-            if (fund && fund.constituents) {
+            if (false) {
                 fund.constituents.forEach(c => {
                     const indirectVal = val * (c.weight / 100);
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'mfVal')

[Killed] BlockStatement
src/calculator.js:44:48
         } else {
             const fund = FUNDS.find(f => f.id === h.instrumentId);
             if (fund && fund.constituents) {
-                fund.constituents.forEach(c => {
-                    const indirectVal = val * (c.weight / 100);
-                    const entry = getStockEntry(c.isin);
-                    if (h.type === 'MF') entry.mfVal += indirectVal;
-                    if (h.type === 'ETF') entry.etfVal += indirectVal;
-                    entry.totalVal += indirectVal;
-                });
+                fund.constituents.forEach(c => {});
             }
         }
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'mfVal')

[Killed] ArithmeticOperator
src/calculator.js:45:41
             const fund = FUNDS.find(f => f.id === h.instrumentId);
             if (fund && fund.constituents) {
                 fund.constituents.forEach(c => {
-                    const indirectVal = val * (c.weight / 100);
+                    const indirectVal = val / (c.weight / 100);
                     const entry = getStockEntry(c.isin);
                     if (h.type === 'MF') entry.mfVal += indirectVal;
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 650
Received: 153846.15384615384

Expected precision:    2
Expected difference: < 0.005
Received difference:   153196.15384615384

[Killed] ArithmeticOperator
src/calculator.js:45:48
             const fund = FUNDS.find(f => f.id === h.instrumentId);
             if (fund && fund.constituents) {
                 fund.constituents.forEach(c => {
-                    const indirectVal = val * (c.weight / 100);
+                    const indirectVal = val * (c.weight * 100);
                     const entry = getStockEntry(c.isin);
                     if (h.type === 'MF') entry.mfVal += indirectVal;
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 650
Received: 6500000

Expected precision:    2
Expected difference: < 0.005
Received difference:   6499350

[Killed] ConditionalExpression
src/calculator.js:47:25
                 fund.constituents.forEach(c => {
                     const indirectVal = val * (c.weight / 100);
                     const entry = getStockEntry(c.isin);
-                    if (h.type === 'MF') entry.mfVal += indirectVal;
+                    if (false) entry.mfVal += indirectVal;
                     if (h.type === 'ETF') entry.etfVal += indirectVal;
                     entry.totalVal += indirectVal;
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 650
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   650

[Killed] EqualityOperator
src/calculator.js:47:25
                 fund.constituents.forEach(c => {
                     const indirectVal = val * (c.weight / 100);
                     const entry = getStockEntry(c.isin);
-                    if (h.type === 'MF') entry.mfVal += indirectVal;
+                    if (h.type !== 'MF') entry.mfVal += indirectVal;
                     if (h.type === 'ETF') entry.etfVal += indirectVal;
                     entry.totalVal += indirectVal;
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 650
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   650

[Survived] EqualityOperator
src/calculator.js:48:25
                     const indirectVal = val * (c.weight / 100);
                     const entry = getStockEntry(c.isin);
                     if (h.type === 'MF') entry.mfVal += indirectVal;
-                    if (h.type === 'ETF') entry.etfVal += indirectVal;
+                    if (h.type !== 'ETF') entry.etfVal += indirectVal;
                     entry.totalVal += indirectVal;
                 });

[Survived] ConditionalExpression
src/calculator.js:48:25
                     const indirectVal = val * (c.weight / 100);
                     const entry = getStockEntry(c.isin);
                     if (h.type === 'MF') entry.mfVal += indirectVal;
-                    if (h.type === 'ETF') entry.etfVal += indirectVal;
+                    if (false) entry.etfVal += indirectVal;
                     entry.totalVal += indirectVal;
                 });

[Killed] AssignmentOperator
src/calculator.js:49:21
                     const entry = getStockEntry(c.isin);
                     if (h.type === 'MF') entry.mfVal += indirectVal;
                     if (h.type === 'ETF') entry.etfVal += indirectVal;
-                    entry.totalVal += indirectVal;
+                    entry.totalVal -= indirectVal;
                 });
             }
killedBy: Portfolio Exposure Calculator Calculates mutual fund overlap exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'mfVal')

[Survived] MethodExpression
src/calculator.js:56:27
     });
 
     // Finalize results
-    const stockExposure = Array.from(exposureMap.values())
-        .map(s => ({
-            ...s,
-            exposurePct: (totalValue > 0) ? (s.totalVal / totalValue) * 100 : 0
-        }))
-        .filter(s => s.totalVal > 0)
+    const stockExposure = Array.from(exposureMap.values()).map(s => ({
+  ...s,
+  exposurePct: totalValue > 0 ? s.totalVal / totalValue * 100 : 0
+}))
         .sort((a, b) => b.totalVal - a.totalVal);
 

[Survived] MethodExpression
src/calculator.js:56:27
     });
 
     // Finalize results
-    const stockExposure = Array.from(exposureMap.values())
-        .map(s => ({
-            ...s,
-            exposurePct: (totalValue > 0) ? (s.totalVal / totalValue) * 100 : 0
-        }))
-        .filter(s => s.totalVal > 0)
-        .sort((a, b) => b.totalVal - a.totalVal);
+    const stockExposure = Array.from(exposureMap.values()).map(s => ({
+  ...s,
+  exposurePct: totalValue > 0 ? s.totalVal / totalValue * 100 : 0
+})).filter(s => s.totalVal > 0);
 
     return {

[Killed] ArrowFunction
src/calculator.js:57:14
 
     // Finalize results
     const stockExposure = Array.from(exposureMap.values())
-        .map(s => ({
-            ...s,
-            exposurePct: (totalValue > 0) ? (s.totalVal / totalValue) * 100 : 0
-        }))
+        .map(() => undefined)
         .filter(s => s.totalVal > 0)
         .sort((a, b) => b.totalVal - a.totalVal);
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'totalVal')

[Killed] EqualityOperator
src/calculator.js:59:27
     const stockExposure = Array.from(exposureMap.values())
         .map(s => ({
             ...s,
-            exposurePct: (totalValue > 0) ? (s.totalVal / totalValue) * 100 : 0
+            exposurePct: (totalValue <= 0) ? (s.totalVal / totalValue) * 100 : 0
         }))
         .filter(s => s.totalVal > 0)
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] ArithmeticOperator
src/calculator.js:59:45
     const stockExposure = Array.from(exposureMap.values())
         .map(s => ({
             ...s,
-            exposurePct: (totalValue > 0) ? (s.totalVal / totalValue) * 100 : 0
+            exposurePct: (totalValue > 0) ? s.totalVal / totalValue / 100 : 0
         }))
         .filter(s => s.totalVal > 0)
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0.01

[Killed] EqualityOperator
src/calculator.js:61:22
             ...s,
             exposurePct: (totalValue > 0) ? (s.totalVal / totalValue) * 100 : 0
         }))
-        .filter(s => s.totalVal > 0)
+        .filter(s => s.totalVal <= 0)
         .sort((a, b) => b.totalVal - a.totalVal);
 
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'ticker')

[Killed] ConditionalExpression
src/calculator.js:61:22
             ...s,
             exposurePct: (totalValue > 0) ? (s.totalVal / totalValue) * 100 : 0
         }))
-        .filter(s => s.totalVal > 0)
+        .filter(s => false)
         .sort((a, b) => b.totalVal - a.totalVal);
 
killedBy: Portfolio Exposure Calculator Calculates individual stock exposure correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'ticker')

[Survived] ArithmeticOperator
src/calculator.js:62:25
             exposurePct: (totalValue > 0) ? (s.totalVal / totalValue) * 100 : 0
         }))
         .filter(s => s.totalVal > 0)
-        .sort((a, b) => b.totalVal - a.totalVal);
+        .sort((a, b) => b.totalVal + a.totalVal);
 
     return {

[Survived] ArrowFunction
src/calculator.js:62:15
             exposurePct: (totalValue > 0) ? (s.totalVal / totalValue) * 100 : 0
         }))
         .filter(s => s.totalVal > 0)
-        .sort((a, b) => b.totalVal - a.totalVal);
+        .sort(() => undefined);
 
     return {
